"""
Задание №2
Представлен список чисел. Необходимо вывести элементы исходного списка,
значения которых больше предыдущего элемента
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
"""
"""
Программа последовательно сравнивает два соседних числа в списке. Если последующее число больше предыдущего,
то оно записывается в новый список. Используется генератор списков.
"""
num_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
max_idx = len(num_list) - 1
new_list = [num_list[el + 1] for el in range(0, max_idx) if num_list[el + 1] > num_list[el]]
print(new_list)